app/policies/fact_policy.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update?
      return true if (user.present? && user == fact.user) || (user.has_role? :admin)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def destroy?
      return true if (user.present? && user == fact.user) || (user.has_role? :admin)