app/controllers/facts_controller.rb

  def index
    @facts = Fact.paginate(page: params[:page])
---
SELECT "facts".* FROM "facts" WHERE "facts"."deleted_at" IS NULL LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "facts" WHERE "facts"."deleted_at" IS NULL

  def create

   @fact = Fact.new(fact_params)
   @fact.user = current_user
   authorize @fact

    respond_to do |format|
      if @fact.save
---
INSERT INTO "facts" ("name", "facts", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "anugrah"], ["facts", "joy3"], ["created_at", "2021-02-13 19:12:26.863000"], ["updated_at", "2021-02-13 19:12:26.863000"], ["user_id", 3]]

  def destroy
    @fact.destroy
---
DELETE FROM "facts" WHERE "facts"."id" = ?  [["id", 6]]

    def set_fact
      @fact = Fact.find(params[:id])
---
SELECT "facts".* FROM "facts" WHERE "facts"."deleted_at" IS NULL AND "facts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]